# Area Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Area Class
Members See Also
---
Provides access to the area topology in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class Area : SpatialElement
```

Visual Basic
---
```text
Public Class Area _
	Inherits SpatialElement
```

Visual C++
---
```text
public ref class Area : public SpatialElement
```

# Remarks
The area object can be queried for its boundary for use in space planning tools.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..SpatialElement Autodesk.Revit.DB..::..Area
# See Also
Area Members
Autodesk.Revit.DB Namespace